app/models/message.rb

SELECT  "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC LIMIT ?  [["LIMIT", 20]]
---
  scope :custom_display, -> {order(:created_at).last(20)}